notes/Un-reviewed/IELTs_listening_vocab_17to11.org
#+title: Vocabulary of listening in IELTs from 17 to 11
#+date: Sun Aug  6 16:05:59 2023
#+author: Zi Liang
#+email: liangzid@stu.xjtu.edu.cn
#+latex_class: elegantpaper

** unfamiliar words
*** 11
+ code: Need to know the *code* for the cleaning cupboard.
+ mammals: Looked for hotspots for marine(海洋的) *mammals* (哺乳动物).
+ consumption: catch fish for the purpose of *consumption* （消耗量） .
+ hostel: Currently staying in a hostel（hotel） during the week.
+ canal: Beside a *canal *（水渠） .
+ curved: the walls are made of local wood and are *curved* （逶迤，弯弯曲曲） in shape.
+ refurbished: It will be *refurbished* （翻新） .
+ flute: play the *flute* （笛）.
+ moist: uses established practices to make sure soil （土壤） remains fertile （肥，丰饶） and *moist* （潮湿的）.
+ cattle: taking place on a big *cattle* （黄牛） farm.
*** 12
+ bullying: conflict mostly consists of behaviour in the general category of *bullying* （欺辱，蛮，残虐）.
+ superiority: Offen a result of people wanting to prove their *superiority* （优越性）.
+ democratic: A structure that is more *democratic* （民主） may create a feeling of uncertainty about who staff should report to.
+ mediator: Someone from outside the company may be given the role of *mediator* （调解员） in order to resolve conflicts.
+ insects: It has also recently been found to affect birds which feed on *insects* .
+ reproduction
+ temporary: wants a *temporary* job
+ cheese: cannot eat *cheese* .
+ youth: is currently doing voluntary work with members of a *youth* club.
+ fountain: the sound of a *fountain* in a town.
+ lively: Plenty of activity in urban environments which are *lively* , but also allow people to relax.
*** 13
+ knife: a special course in skills with a *knife*
+ tails: use their tails to help them communicate.
+ permanent: some changes may not be *permanent* （永久的）
+ insurance: cost of membership includes the club fee and *insurance*
+ stadium: Tuesdays at 5.30 am. meet at the *stadium* （大球场？ 比赛场）
+ tongue & lizard: They are brown, but recognisable by their blue tongue （舌头）. （蜥蜴）
+ finance: Alex did his training in the *finance* department （部门）.
+ destruction
+ taxation: coffee was used as a form of taxation
*** 14
+ furniture: Reason for visit: business (to buy antique （古董） *furniture* )
+ floor: on the floor of the ocean may be affected
+ gates: stored water is released through *gates* , driving the turbines （涡轮） in the reverse direction
+ fuel: no *fuel* is required to make it work
+ migration
+ vitamins: no regular medication apart from *vitamins* .
+ comets: Aristotle also described halos （光环，日晕） and *comets* （彗星，扫把星）
+ instruments
+ thermometer: Galileo invented the *thermometer* （温度计）
+ microphone
+ exhibition: area for coffee and an *exhibition*
+ pool: a spa and rooftop *pool*
+ carnival: It has been invited to play in the town's *carnival* （嘉年华）
+ drummer: talk by a *drummer*
+ film
+ parade: Joe hopes the band will attend a *parade* （巡游） next month
+ opera
+ clarinet: by piano and *clarinet* （单簧管）
+ Olympics
+ roses: see the *roses* in pots （锅，罐） on the terrance （？）
+ cabins: in hotel rooms or *cabins* （船舱，车厢，小屋）
*** 16
+ decorate: Build, *decorate* （修饰，点缀，装饰） , and program a humanoid robot
+ practical
+ capitalism: Adam Smith's ideas on *capitalism* （资本主义） were influenced by Stoicism.
+ focus: A photo which is not correctly in *focus* (对焦，焦点) cannot be fixed.
+ therapy: For those with mental (精神) illness, dance could be used as a form of *therapy* （疗法）.
+ fitness
+ calories: as many *calories* as other quite intense （剧烈的） forms of exercise
+ obesity: women suffering from *obesity* （肥胖症） benefited from doing Zumba.
+ habit: Zumba became a *habit* for participants.
+ medication: Charlie's *medication* （用药）
+ equipment
+ ecomomic
+ rough: Early yarns （纱线） felt *rough* （粗） to touch
+ bone: such as wood and *bone*
+ garage: building was original a *garage* （车库）
+ monument: view of hilltop *monument* （碑，古迹） from the bedroom
+ spice: Portuguese （葡萄牙语） ships transporting （运输） *spice* （香料） stopped at the island to collect food and water
+ colony/settlement: The Dutch established a *colony/settlement* （殖民地，定居点） on the island.
+ movement: the birds were capable of rapid *movement*
*** 17 (no test 1 inlucded)
+ transport: help by providing *transport*
+ biligual: are becoming *biligual* （双语的） very quickly
+ boots: Also advisable to hire *boots* for warmth
+ mud: buired themselves in *mud*
+ feather: the loss of *feather*
+ atlas: the first *atlas* （大地图，图谱） to show the migration of European birds was printed
+ fridge: cleaning the *fridge* （冰箱）
+ balcony: washing down the *balcony* （楼台）
+ electrician: They can organise a plumber （水管工） or an *electrician* （电工） if necessary
+ dust: allergic （过敏） to *dust*
+ climate: *climate* are in Canada and North America
+ *rocks*: used hot *rocks* to heat the sap
+ diameter
+ tube: A tap is drilled into the trunk and a *tube* （管） carries the sap （汁液） into a bucket.
+ fire
+ liter: make a *liter* （升） of maple （枫） syrup （浆）

** special pronouncation
+ emotion: |a,mo,tion|
+ political: p很轻，holitic
+ instruments: instreaments
+ egg: arc
+ rats: ruts
+ steam: stem
+ rough： ruff
** other high frequency
+ private
+ market
+ brain
+ parking park
+ cafe、
+ weekends
+ clubs
+ regional
+ enegy
+ physics
+ dance
+ support
+ ices eyes
+ wine
+ cameras
+ wednesday
+ opportunity
+ brain
+ rats
+ garden
+ quiz
+ collecting
+ records
+ grammar
+ fluent
+ police
+ training
** Selected English Materials
1. 17 Test 4
2. 16 Test 4
3. 14 Test 3
