IELTs_listening_vocab_17to11.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-09-16 六 20:40 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vocabulary of listening in IELTs from 17 to 11</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Vocabulary of listening in IELTs from 17 to 11</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8947bcd">1. unfamiliar words</a>
<ul>
<li><a href="#orgdb16bb5">1.1. 11</a></li>
<li><a href="#orgc93fc85">1.2. 12</a></li>
<li><a href="#orgf53472a">1.3. 13</a></li>
<li><a href="#orgfe85ae6">1.4. 14</a></li>
<li><a href="#org105c97d">1.5. 16</a></li>
<li><a href="#org953eef6">1.6. 17 (no test 1 inlucded)</a></li>
</ul>
</li>
<li><a href="#org3af1b9b">2. special pronouncation</a></li>
<li><a href="#orgede846f">3. other high frequency</a></li>
<li><a href="#org745e9c4">4. Selected English Materials</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8947bcd" class="outline-2">
<h2 id="org8947bcd"><span class="section-number-2">1.</span> unfamiliar words</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdb16bb5" class="outline-3">
<h3 id="orgdb16bb5"><span class="section-number-3">1.1.</span> 11</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>code: Need to know the <b>code</b> for the cleaning cupboard.</li>
<li>mammals: Looked for hotspots for marine(海洋的) <b>mammals</b> (哺乳动物).</li>
<li>consumption: catch fish for the purpose of <b>consumption</b> （消耗量） .</li>
<li>hostel: Currently staying in a hostel（hotel） during the week.</li>
<li>canal: Beside a *canal *（水渠） .</li>
<li>curved: the walls are made of local wood and are <b>curved</b> （逶迤，弯弯曲曲） in shape.</li>
<li>refurbished: It will be <b>refurbished</b> （翻新） .</li>
<li>flute: play the <b>flute</b> （笛）.</li>
<li>moist: uses established practices to make sure soil （土壤） remains fertile （肥，丰饶） and <b>moist</b> （潮湿的）.</li>
<li>cattle: taking place on a big <b>cattle</b> （黄牛） farm.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc93fc85" class="outline-3">
<h3 id="orgc93fc85"><span class="section-number-3">1.2.</span> 12</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>bullying: conflict mostly consists of behaviour in the general category of <b>bullying</b> （欺辱，蛮，残虐）.</li>
<li>superiority: Offen a result of people wanting to prove their <b>superiority</b> （优越性）.</li>
<li>democratic: A structure that is more <b>democratic</b> （民主） may create a feeling of uncertainty about who staff should report to.</li>
<li>mediator: Someone from outside the company may be given the role of <b>mediator</b> （调解员） in order to resolve conflicts.</li>
<li>insects: It has also recently been found to affect birds which feed on <b>insects</b> .</li>
<li>reproduction</li>
<li>temporary: wants a <b>temporary</b> job</li>
<li>cheese: cannot eat <b>cheese</b> .</li>
<li>youth: is currently doing voluntary work with members of a <b>youth</b> club.</li>
<li>fountain: the sound of a <b>fountain</b> in a town.</li>
<li>lively: Plenty of activity in urban environments which are <b>lively</b> , but also allow people to relax.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf53472a" class="outline-3">
<h3 id="orgf53472a"><span class="section-number-3">1.3.</span> 13</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>knife: a special course in skills with a <b>knife</b></li>
<li>tails: use their tails to help them communicate.</li>
<li>permanent: some changes may not be <b>permanent</b> （永久的）</li>
<li>insurance: cost of membership includes the club fee and <b>insurance</b></li>
<li>stadium: Tuesdays at 5.30 am. meet at the <b>stadium</b> （大球场？ 比赛场）</li>
<li>tongue &amp; lizard: They are brown, but recognisable by their blue tongue （舌头）. （蜥蜴）</li>
<li>finance: Alex did his training in the <b>finance</b> department （部门）.</li>
<li>destruction</li>
<li>taxation: coffee was used as a form of taxation</li>
</ul>
</div>
</div>
<div id="outline-container-orgfe85ae6" class="outline-3">
<h3 id="orgfe85ae6"><span class="section-number-3">1.4.</span> 14</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>furniture: Reason for visit: business (to buy antique （古董） <b>furniture</b> )</li>
<li>floor: on the floor of the ocean may be affected</li>
<li>gates: stored water is released through <b>gates</b> , driving the turbines （涡轮） in the reverse direction</li>
<li>fuel: no <b>fuel</b> is required to make it work</li>
<li>migration</li>
<li>vitamins: no regular medication apart from <b>vitamins</b> .</li>
<li>comets: Aristotle also described halos （光环，日晕） and <b>comets</b> （彗星，扫把星）</li>
<li>instruments</li>
<li>thermometer: Galileo invented the <b>thermometer</b> （温度计）</li>
<li>microphone</li>
<li>exhibition: area for coffee and an <b>exhibition</b></li>
<li>pool: a spa and rooftop <b>pool</b></li>
<li>carnival: It has been invited to play in the town's <b>carnival</b> （嘉年华）</li>
<li>drummer: talk by a <b>drummer</b></li>
<li>film</li>
<li>parade: Joe hopes the band will attend a <b>parade</b> （巡游） next month</li>
<li>opera</li>
<li>clarinet: by piano and <b>clarinet</b> （单簧管）</li>
<li>Olympics</li>
<li>roses: see the <b>roses</b> in pots （锅，罐） on the terrance （？）</li>
<li>cabins: in hotel rooms or <b>cabins</b> （船舱，车厢，小屋）</li>
</ul>
</div>
</div>
<div id="outline-container-org105c97d" class="outline-3">
<h3 id="org105c97d"><span class="section-number-3">1.5.</span> 16</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>decorate: Build, <b>decorate</b> （修饰，点缀，装饰） , and program a humanoid robot</li>
<li>practical</li>
<li>capitalism: Adam Smith's ideas on <b>capitalism</b> （资本主义） were influenced by Stoicism.</li>
<li>focus: A photo which is not correctly in <b>focus</b> (对焦，焦点) cannot be fixed.</li>
<li>therapy: For those with mental (精神) illness, dance could be used as a form of <b>therapy</b> （疗法）.</li>
<li>fitness</li>
<li>calories: as many <b>calories</b> as other quite intense （剧烈的） forms of exercise</li>
<li>obesity: women suffering from <b>obesity</b> （肥胖症） benefited from doing Zumba.</li>
<li>habit: Zumba became a <b>habit</b> for participants.</li>
<li>medication: Charlie's <b>medication</b> （用药）</li>
<li>equipment</li>
<li>ecomomic</li>
<li>rough: Early yarns （纱线） felt <b>rough</b> （粗） to touch</li>
<li>bone: such as wood and <b>bone</b></li>
<li>garage: building was original a <b>garage</b> （车库）</li>
<li>monument: view of hilltop <b>monument</b> （碑，古迹） from the bedroom</li>
<li>spice: Portuguese （葡萄牙语） ships transporting （运输） <b>spice</b> （香料） stopped at the island to collect food and water</li>
<li>colony/settlement: The Dutch established a <b>colony/settlement</b> （殖民地，定居点） on the island.</li>
<li>movement: the birds were capable of rapid <b>movement</b></li>
</ul>
</div>
</div>
<div id="outline-container-org953eef6" class="outline-3">
<h3 id="org953eef6"><span class="section-number-3">1.6.</span> 17 (no test 1 inlucded)</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>transport: help by providing <b>transport</b></li>
<li>biligual: are becoming <b>biligual</b> （双语的） very quickly</li>
<li>boots: Also advisable to hire <b>boots</b> for warmth</li>
<li>mud: buired themselves in <b>mud</b></li>
<li>feather: the loss of <b>feather</b></li>
<li>atlas: the first <b>atlas</b> （大地图，图谱） to show the migration of European birds was printed</li>
<li>fridge: cleaning the <b>fridge</b> （冰箱）</li>
<li>balcony: washing down the <b>balcony</b> （楼台）</li>
<li>electrician: They can organise a plumber （水管工） or an <b>electrician</b> （电工） if necessary</li>
<li>dust: allergic （过敏） to <b>dust</b></li>
<li>climate: <b>climate</b> are in Canada and North America</li>
<li><b>rocks</b>: used hot <b>rocks</b> to heat the sap</li>
<li>diameter</li>
<li>tube: A tap is drilled into the trunk and a <b>tube</b> （管） carries the sap （汁液） into a bucket.</li>
<li>fire</li>
<li>liter: make a <b>liter</b> （升） of maple （枫） syrup （浆）</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3af1b9b" class="outline-2">
<h2 id="org3af1b9b"><span class="section-number-2">2.</span> special pronouncation</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>emotion: |a,mo,tion|</li>
<li>political: p很轻，holitic</li>
<li>instruments: instreaments</li>
<li>egg: arc</li>
<li>rats: ruts</li>
<li>steam: stem</li>
<li>rough： ruff</li>
</ul>
</div>
</div>
<div id="outline-container-orgede846f" class="outline-2">
<h2 id="orgede846f"><span class="section-number-2">3.</span> other high frequency</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>private</li>
<li>market</li>
<li>brain</li>
<li>parking park</li>
<li>cafe、</li>
<li>weekends</li>
<li>clubs</li>
<li>regional</li>
<li>enegy</li>
<li>physics</li>
<li>dance</li>
<li>support</li>
<li>ices eyes</li>
<li>wine</li>
<li>cameras</li>
<li>wednesday</li>
<li>opportunity</li>
<li>brain</li>
<li>rats</li>
<li>garden</li>
<li>quiz</li>
<li>collecting</li>
<li>records</li>
<li>grammar</li>
<li>fluent</li>
<li>police</li>
<li>training</li>
</ul>
</div>
</div>
<div id="outline-container-org745e9c4" class="outline-2">
<h2 id="org745e9c4"><span class="section-number-2">4.</span> Selected English Materials</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>17 Test 4</li>
<li>16 Test 4</li>
<li>14 Test 3</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Sun Aug  6 16:05:59 2023</p>
<p class="author">Author: Zi Liang</p>
<p class="date">Created: 2023-09-16 六 20:40</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
